// 65_DFS.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int xd[4] = { -1, 0, 1, 0 };
int yd[4] = { 0, 1, 0, -1 };
int cnt = 0;

int ch[9][9] = {0};
int map[9][9] = { {1,1,1,1,1,1,1,1,1},
					  {1,0,0,0,0,0,0,0,1},
					  {1,0,1,1,1,1,1,0,1},
					  {1,0,0,0,1,0,0,0,1},
					  {1,1,1,0,1,0,1,1,1},
					  {1,1,1,0,0,0,0,1,1},
					  {1,1,1,0,1,1,0,0,1},
					  {1,1,0,0,0,0,0,0,1},
					  {1,1,1,1,1,1,1,1,1} };

void DFS(int n, int m)
{
	if (n == 7 && m == 7)
	{
		cnt++;
	}
	else
	{
		for (int i = 0; i < 4; i++) //0,1,2,3
		{
			//지나갈 수 있고, 한번도 안 지나온 곳인지 확인
			if (map[n + xd[i]][m + yd[i]] == 0 && ch[n + xd[i]][m + yd[i]] == 0)
			{
				ch[n + xd[i]][m + yd[i]] = 1;
				DFS(n + xd[i], m + yd[i]);
				ch[n + xd[i]][m + yd[i]] = 0;
			}
		}
	}
}

int main()
{
	ch[1][1] = 1;
	DFS(1, 1);
	std::cout << cnt;
}
